{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"dim_ordering": "tf", "b_constraint": null, "trainable": true, "activity_regularizer": null, "nb_col": 5, "border_mode": "valid", "bias": true, "name": "convolution2d_1", "nb_filter": 8, "nb_row": 5, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null}, "name": "convolution2d_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"dim_ordering": "tf", "b_constraint": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "border_mode": "valid", "bias": true, "name": "convolution2d_2", "nb_filter": 16, "nb_row": 3, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null}, "name": "convolution2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_2"}, {"class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"input_dim": 576, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "output_dim": 256, "trainable": true, "name": "dense_1"}, "name": "dense_1"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"trainable": true, "p": 0.4, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"input_dim": 256, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "relu", "b_regularizer": null, "output_dim": 128, "trainable": true, "name": "dense_2"}, "name": "dense_2"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"trainable": true, "p": 0.4, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"input_dim": 128, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 1, "trainable": true, "name": "dense_3"}, "name": "dense_3"}], "name": "model_1", "output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.0"}