{"config": {"output_layers": [["dense_3", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"input_dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 32, 32, 3]}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_2", "config": {"subsample": [1, 1], "name": "convolution2d_2", "trainable": true, "b_constraint": null, "W_constraint": null, "nb_col": 5, "nb_row": 5, "activation": "relu", "init": "glorot_uniform", "bias": true, "nb_filter": 8, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_3", "config": {"subsample": [1, 1], "name": "convolution2d_3", "trainable": true, "b_constraint": null, "W_constraint": null, "nb_col": 5, "nb_row": 5, "activation": "relu", "init": "glorot_uniform", "bias": true, "nb_filter": 16, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "maxpooling2d_2", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "config": {"name": "dense_1", "trainable": true, "b_constraint": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "bias": true, "output_dim": 256, "W_regularizer": null, "b_regularizer": null, "input_dim": 400, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_1", "config": {"p": 0.4, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2", "config": {"name": "dense_2", "trainable": true, "b_constraint": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "bias": true, "output_dim": 128, "W_regularizer": null, "b_regularizer": null, "input_dim": 256, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "dropout_2", "config": {"p": 0.4, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_3", "config": {"name": "dense_3", "trainable": true, "b_constraint": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "input_dim": 128, "activity_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "1.2.0", "class_name": "Model"}